# Terraform environment prod
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_key_vault_certificate.vpn will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_certificate" "vpn" {
      + certificate_data                = (known after apply)
      + certificate_data_base64         = (known after apply)
      + certificate_policy              = (known after apply)
      + expires                         = (known after apply)
      + id                              = (known after apply)
      + key_vault_id                    = (known after apply)
      + name                            = "VPNRootCert"
      + not_before                      = (known after apply)
      + resource_manager_id             = (known after apply)
      + resource_manager_versionless_id = (known after apply)
      + secret_id                       = (known after apply)
      + tags                            = (known after apply)
      + thumbprint                      = (known after apply)
      + version                         = (known after apply)
      + versionless_id                  = (known after apply)
      + versionless_secret_id           = (known after apply)
    }

  # azuread_application.vpn will be created
  + resource "azuread_application" "vpn" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "Product: Authorization VPN"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "a9585a64-20f0-4d18-aba6-9930f92b809c",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + api {
          + requested_access_token_version = 2

          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access the VPN API on behalf of the signed-in user."
              + admin_consent_display_name = "Access VPN API"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "Admin"
              + value                      = "VPN.Access"
            }
        }
    }

  # azuread_application_identifier_uri.vpn will be created
  + resource "azuread_application_identifier_uri" "vpn" {
      + application_id = (known after apply)
      + id             = (known after apply)
      + identifier_uri = (known after apply)
    }

  # azuread_application_pre_authorized.vpn will be created
  + resource "azuread_application_pre_authorized" "vpn" {
      + application_id       = (known after apply)
      + authorized_client_id = "c632b3df-fb67-4d84-bdcf-b95ad541b5c8"
      + id                   = (known after apply)
      + permission_ids       = (known after apply)
    }

  # azuread_service_principal.vpn will be created
  + resource "azuread_service_principal" "vpn" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)
    }

  # azurerm_app_configuration.app_configuration will be created
  + resource "azurerm_app_configuration" "app_configuration" {
      + endpoint                   = (known after apply)
      + id                         = (known after apply)
      + local_auth_enabled         = false
      + location                   = "norwayeast"
      + name                       = "appconfaltinnauth001hub"
      + primary_read_key           = (known after apply)
      + primary_write_key          = (known after apply)
      + public_network_access      = "Enabled"
      + purge_protection_enabled   = false
      + resource_group_name        = "rgaltinnauth001hub"
      + secondary_read_key         = (known after apply)
      + secondary_write_key        = (known after apply)
      + sku                        = "standard"
      + soft_delete_retention_days = 7
      + tags                       = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_firewall.firewall will be created
  + resource "azurerm_firewall" "firewall" {
      + dns_proxy_enabled   = (known after apply)
      + firewall_policy_id  = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "fwaltinnauth001hub"
      + resource_group_name = "rgaltinnauth001hub"
      + sku_name            = "AZFW_VNet"
      + sku_tier            = "Standard"
      + tags                = (known after apply)
      + threat_intel_mode   = (known after apply)

      + ip_configuration {
          + name                 = "FrontendIPv4PublicIP"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }

      + management_ip_configuration {
          + name                 = "ManagementIPv4PublicIP"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # azurerm_firewall_policy.firewall will be created
  + resource "azurerm_firewall_policy" "firewall" {
      + child_policies           = (known after apply)
      + firewalls                = (known after apply)
      + id                       = (known after apply)
      + location                 = "norwayeast"
      + name                     = "fwpolicyaltinnauth001hub"
      + resource_group_name      = "rgaltinnauth001hub"
      + rule_collection_groups   = (known after apply)
      + sku                      = "Standard"
      + tags                     = (known after apply)
      + threat_intelligence_mode = "Alert"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_key_vault.key_vault will be created
  + resource "azurerm_key_vault" "key_vault" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "kvaltinnauth001hub"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "rgaltinnauth001hub"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = (known after apply)
      + tenant_id                     = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
      + vault_uri                     = (known after apply)
    }

  # azurerm_key_vault_certificate.vpn will be created
  + resource "azurerm_key_vault_certificate" "vpn" {
      + certificate_attribute           = (known after apply)
      + certificate_data                = (known after apply)
      + certificate_data_base64         = (known after apply)
      + id                              = (known after apply)
      + key_vault_id                    = (known after apply)
      + name                            = "VPNRootCert"
      + resource_manager_id             = (known after apply)
      + resource_manager_versionless_id = (known after apply)
      + secret_id                       = (known after apply)
      + thumbprint                      = (known after apply)
      + version                         = (known after apply)
      + versionless_id                  = (known after apply)
      + versionless_secret_id           = (known after apply)

      + certificate {
          + contents = (sensitive value)
        }
    }

  # azurerm_private_dns_resolver.resolver will be created
  + resource "azurerm_private_dns_resolver" "resolver" {
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "dnsresaltinnauth001hub"
      + resource_group_name = "rgaltinnauth001hub"
      + tags                = (known after apply)
      + virtual_network_id  = (known after apply)
    }

  # azurerm_private_dns_resolver_inbound_endpoint.resolver will be created
  + resource "azurerm_private_dns_resolver_inbound_endpoint" "resolver" {
      + id                      = (known after apply)
      + location                = "norwayeast"
      + name                    = "PrivateLink"
      + private_dns_resolver_id = (known after apply)

      + ip_configurations {
          + private_ip_address           = (known after apply)
          + private_ip_allocation_method = "Dynamic"
          + subnet_id                    = (known after apply)
        }
    }

  # azurerm_private_dns_zone.app_configuration will be created
  + resource "azurerm_private_dns_zone" "app_configuration" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azconfig.io"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rgaltinnauth001hub"
      + tags                                                  = (known after apply)
    }

  # azurerm_private_dns_zone.blob will be created
  + resource "azurerm_private_dns_zone" "blob" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.blob.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rgaltinnauth001hub"
      + tags                                                  = (known after apply)
    }

  # azurerm_private_dns_zone.key_vault will be created
  + resource "azurerm_private_dns_zone" "key_vault" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.vaultcore.azure.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rgaltinnauth001hub"
      + tags                                                  = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.app_configuration will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "app_configuration" {
      + id                    = (known after apply)
      + name                  = "app-configuration"
      + private_dns_zone_name = "privatelink.azconfig.io"
      + registration_enabled  = false
      + resource_group_name   = "rgaltinnauth001hub"
      + tags                  = (known after apply)
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.blob will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "blob" {
      + id                    = (known after apply)
      + name                  = "storage-account-blob"
      + private_dns_zone_name = "privatelink.blob.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "rgaltinnauth001hub"
      + tags                  = (known after apply)
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.key_vault will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "key_vault" {
      + id                    = (known after apply)
      + name                  = "key-vault"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "rgaltinnauth001hub"
      + tags                  = (known after apply)
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_endpoint.app_configuration will be created
  + resource "azurerm_private_endpoint" "app_configuration" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "nicappconfaltinnauth001hub"
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "pepappconfaltinnauth001hub"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "rgaltinnauth001hub"
      + subnet_id                     = (known after apply)
      + tags                          = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "app-configuration"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "app-configuration"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "configurationStores",
            ]
        }
    }

  # azurerm_private_endpoint.blob will be created
  + resource "azurerm_private_endpoint" "blob" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "nicstblobaltinnauth001hub"
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "pepstblobaltinnauth001hub"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "rgaltinnauth001hub"
      + subnet_id                     = (known after apply)
      + tags                          = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "storage-account-blob"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "storage-account-blob"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # azurerm_private_endpoint.key_vault will be created
  + resource "azurerm_private_endpoint" "key_vault" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "nickvaltinnauth001hub"
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "pepkvaltinnauth001hub"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "rgaltinnauth001hub"
      + subnet_id                     = (known after apply)
      + tags                          = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "key-vault"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "key-vault"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # azurerm_public_ip.frontend_ipv4 will be created
  + resource "azurerm_public_ip" "frontend_ipv4" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "norwayeast"
      + name                    = "pipfwipv4altinnauth001hub"
      + public_ip_prefix_id     = (known after apply)
      + resource_group_name     = "rgaltinnauth001hub"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = (known after apply)
    }

  # azurerm_public_ip.management_ipv4 will be created
  + resource "azurerm_public_ip" "management_ipv4" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "norwayeast"
      + name                    = "pipfwmgmtipv4altinnauth001hub"
      + public_ip_prefix_id     = (known after apply)
      + resource_group_name     = "rgaltinnauth001hub"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = (known after apply)
    }

  # azurerm_public_ip.vpn will be created
  + resource "azurerm_public_ip" "vpn" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "norwayeast"
      + name                    = "pipvpnaltinnauth001hub"
      + public_ip_prefix_id     = (known after apply)
      + resource_group_name     = "rgaltinnauth001hub"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # azurerm_public_ip_prefix.ipv4 will be created
  + resource "azurerm_public_ip_prefix" "ipv4" {
      + id                  = (known after apply)
      + ip_prefix           = (known after apply)
      + ip_version          = "IPv4"
      + location            = "norwayeast"
      + name                = "pipipv4altinnauth001hub"
      + prefix_length       = 30
      + resource_group_name = "rgaltinnauth001hub"
      + sku                 = "Standard"
      + sku_tier            = "Regional"
      + tags                = (known after apply)
    }

  # azurerm_public_ip_prefix.ipv6 will be created
  + resource "azurerm_public_ip_prefix" "ipv6" {
      + id                  = (known after apply)
      + ip_prefix           = (known after apply)
      + ip_version          = "IPv6"
      + location            = "norwayeast"
      + name                = "pipipv6altinnauth001hub"
      + prefix_length       = 126
      + resource_group_name = "rgaltinnauth001hub"
      + sku                 = "Standard"
      + sku_tier            = "Regional"
      + tags                = (known after apply)
    }

  # azurerm_resource_group.hub will be created
  + resource "azurerm_resource_group" "hub" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "rgaltinnauth001hub"
      + tags     = (known after apply)
    }

  # azurerm_role_assignment.key_vault_administrator will be created
  + resource "azurerm_role_assignment" "key_vault_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a9585a64-20f0-4d18-aba6-9930f92b809c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_route_table.vpn will be created
  + resource "azurerm_route_table" "vpn" {
      + bgp_route_propagation_enabled = true
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "rtvpnaltinnauth001hub"
      + resource_group_name           = "rgaltinnauth001hub"
      + route                         = [
          + {
              + address_prefix         = "0.0.0.0/1"
              + name                   = "IPv4ForcedTunneling1"
              + next_hop_in_ip_address = (known after apply)
              + next_hop_type          = "VirtualAppliance"
            },
          + {
              + address_prefix         = "128.0.0.0/1"
              + name                   = "IPv4ForcedTunneling2"
              + next_hop_in_ip_address = (known after apply)
              + next_hop_type          = "VirtualAppliance"
            },
        ]
      + subnets                       = (known after apply)
    }

  # azurerm_storage_account.storage will be created
  + resource "azurerm_storage_account" "storage" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "GRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "norwayeast"
      + min_tls_version                    = "TLS1_2"
      + name                               = "staltinnauth001hub"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rgaltinnauth001hub"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_storage_blob.client_key_cert["andreasisnes"] will be created
  + resource "azurerm_storage_blob" "client_key_cert" {
      + access_tier            = "Cool"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "andreasisnes/andreasisnesKey.pem"
      + parallelism            = 8
      + size                   = 0
      + source_content         = (sensitive value)
      + storage_account_name   = "staltinnauth001hub"
      + storage_container_name = "vpncerts"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.client_pem_cert["andreasisnes"] will be created
  + resource "azurerm_storage_blob" "client_pem_cert" {
      + access_tier            = "Cool"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "andreasisnes/andreasisnesCert.pem"
      + parallelism            = 8
      + size                   = 0
      + source_content         = (known after apply)
      + storage_account_name   = "staltinnauth001hub"
      + storage_container_name = "vpncerts"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.client_pfx_cert["andreasisnes"] will be created
  + resource "azurerm_storage_blob" "client_pfx_cert" {
      + access_tier            = "Cool"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "andreasisnes/andreasisnesCert.pfx"
      + parallelism            = 8
      + size                   = 0
      + source_content         = (known after apply)
      + storage_account_name   = "staltinnauth001hub"
      + storage_container_name = "vpncerts"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_container.certs will be created
  + resource "azurerm_storage_container" "certs" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "vpncerts"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # azurerm_subnet.hub["ApplicationGateway"] will be created
  + resource "azurerm_subnet" "hub" {
      + address_prefixes                              = [
          + "10.202.18.0/24",
          + "fd0a:7204:c37f:2::/64",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "ApplicationGateway"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rgaltinnauth001hub"
      + virtual_network_name                          = "vnetaltinnauth001hub"
    }

  # azurerm_subnet.hub["AzureFirewallManagementSubnet"] will be created
  + resource "azurerm_subnet" "hub" {
      + address_prefixes                              = [
          + "10.202.19.64/26",
          + "fd0a:7204:c37f:4::/64",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureFirewallManagementSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rgaltinnauth001hub"
      + virtual_network_name                          = "vnetaltinnauth001hub"
    }

  # azurerm_subnet.hub["AzureFirewallSubnet"] will be created
  + resource "azurerm_subnet" "hub" {
      + address_prefixes                              = [
          + "10.202.19.0/26",
          + "fd0a:7204:c37f:3::/64",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureFirewallSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rgaltinnauth001hub"
      + virtual_network_name                          = "vnetaltinnauth001hub"
    }

  # azurerm_subnet.hub["Default"] will be created
  + resource "azurerm_subnet" "hub" {
      + address_prefixes                              = [
          + "10.202.16.0/24",
          + "fd0a:7204:c37f::/64",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "Default"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rgaltinnauth001hub"
      + service_endpoints                             = [
          + "Microsoft.KeyVault",
        ]
      + virtual_network_name                          = "vnetaltinnauth001hub"
    }

  # azurerm_subnet.hub["DnsResolver"] will be created
  + resource "azurerm_subnet" "hub" {
      + address_prefixes                              = [
          + "10.202.20.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "DnsResolver"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rgaltinnauth001hub"
      + virtual_network_name                          = "vnetaltinnauth001hub"

      + delegation {
          + name = "dns_resolver"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.Network/dnsResolvers"
            }
        }
    }

  # azurerm_subnet.hub["GatewaySubnet"] will be created
  + resource "azurerm_subnet" "hub" {
      + address_prefixes                              = [
          + "10.202.17.0/24",
          + "fd0a:7204:c37f:1::/64",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "GatewaySubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rgaltinnauth001hub"
      + virtual_network_name                          = "vnetaltinnauth001hub"
    }

  # azurerm_subnet_route_table_association.vpn will be created
  + resource "azurerm_subnet_route_table_association" "vpn" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # azurerm_virtual_network.hub will be created
  + resource "azurerm_virtual_network" "hub" {
      + address_space       = [
          + "10.202.16.0/20",
          + "fd0a:7204:c37f::/51",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "vnetaltinnauth001hub"
      + resource_group_name = "rgaltinnauth001hub"
      + subnet              = (known after apply)
      + tags                = (known after apply)
    }

  # azurerm_virtual_network_dns_servers.hub will be created
  + resource "azurerm_virtual_network_dns_servers" "hub" {
      + dns_servers        = (known after apply)
      + id                 = (known after apply)
      + virtual_network_id = (known after apply)
    }

  # azurerm_virtual_network_gateway.vpn will be created
  + resource "azurerm_virtual_network_gateway" "vpn" {
      + active_active                         = false
      + bgp_route_translation_for_nat_enabled = false
      + dns_forwarding_enabled                = false
      + enable_bgp                            = false
      + generation                            = (known after apply)
      + id                                    = (known after apply)
      + ip_sec_replay_protection_enabled      = true
      + location                              = "norwayeast"
      + name                                  = "vpnaltinnauth001hub"
      + private_ip_address_enabled            = false
      + remote_vnet_traffic_enabled           = false
      + resource_group_name                   = "rgaltinnauth001hub"
      + sku                                   = "VpnGw1"
      + type                                  = "Vpn"
      + virtual_wan_traffic_enabled           = false
      + vpn_type                              = "RouteBased"

      + ip_configuration {
          + name                          = "ip-config"
          + private_ip_address_allocation = "Dynamic"
          + public_ip_address_id          = (known after apply)
          + subnet_id                     = (known after apply)
        }

      + vpn_client_configuration {
          + aad_audience         = (known after apply)
          + aad_issuer           = "https://sts.windows.net/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/"
          + aad_tenant           = "https://login.microsoftonline.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
          + address_space        = [
              + "192.168.20.0/24",
            ]
          + vpn_auth_types       = [
              + "AAD",
              + "Certificate",
            ]
          + vpn_client_protocols = [
              + "OpenVPN",
            ]

          + root_certificate {
              + name             = "VPNRootCert"
              + public_cert_data = (known after apply)
            }
        }
    }

  # pkcs12_from_pem.client_certs["andreasisnes"] will be created
  + resource "pkcs12_from_pem" "client_certs" {
      + ca_pem          = (sensitive value)
      + cert_pem        = (sensitive value)
      + encoding        = "modern2023"
      + id              = (known after apply)
      + private_key_pem = (sensitive value)
      + result          = (known after apply)
    }

  # static_data.static will be created
  + resource "static_data" "static" {
      + data   = (known after apply)
      + id     = (known after apply)
      + output = (known after apply)
    }

  # tls_cert_request.client["andreasisnes"] will be created
  + resource "tls_cert_request" "client" {
      + cert_request_pem = (known after apply)
      + dns_names        = [
          + "andreasisnes",
        ]
      + id               = (known after apply)
      + key_algorithm    = (known after apply)
      + private_key_pem  = (sensitive value)

      + subject {
          + common_name = "andreasisnes"
        }
    }

  # tls_locally_signed_cert.client["andreasisnes"] will be created
  + resource "tls_locally_signed_cert" "client" {
      + allowed_uses          = [
          + "client_auth",
        ]
      + ca_cert_pem           = (known after apply)
      + ca_key_algorithm      = (known after apply)
      + ca_private_key_pem    = (sensitive value)
      + cert_pem              = (known after apply)
      + cert_request_pem      = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + is_ca_certificate     = false
      + ready_for_renewal     = false
      + set_subject_key_id    = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 8760
      + validity_start_time   = (known after apply)
    }

  # tls_private_key.client["andreasisnes"] will be created
  + resource "tls_private_key" "client" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # tls_private_key.root will be created
  + resource "tls_private_key" "root" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # tls_self_signed_cert.root will be created
  + resource "tls_self_signed_cert" "root" {
      + allowed_uses          = []
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + is_ca_certificate     = true
      + key_algorithm         = (known after apply)
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = false
      + set_authority_key_id  = true
      + set_subject_key_id    = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 87600
      + validity_start_time   = (known after apply)

      + subject {
          + common_name         = "Altinn"
          + organizational_unit = "Authorization"
        }
    }

Plan: 50 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `workflow_dispatch` |
| Working Directory | `infra/deploy/hub` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/prod/hub.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_prod_hub.tfstate.tfplan`